### FORMULAES
brew "bat" # cat alternative
brew "bob" # neovim version manager
brew "chezmoi" # dotfiles manager
brew "colima" # containers runtime
brew "curl" # http client
brew "docker" # container engine
brew "docker-compose" # docker tool
brew "eza" # ls replacement
brew "fd" # faster find
brew "fish" # shell
brew "fzf" # fuzzy finder
brew "gcc" # nvim build dependency
brew "jq" # cli json utility
brew "lazydocker" # docker management tool
brew "lua-language-server" # LSP
brew "node" # nodejs
brew "rg" # rip grep
brew "starship" # shell prompt
brew "stylua" # lua code formatter
brew "tree" # show tree like folder representation
brew "typescript-language-server" # LSP
brew "uv" # python package manager
brew "zellij" # terminal multiplexer
brew "zoxide" # better current dir changing
brew "pyright" # LSP
brew "mypy" # python type checking


### CASKS
cask "alacritty" # terminal emulator
cask "anki" # study
cask "brave-browser"
cask "calibre"
cask "digikam"
cask "drawio"
cask "foxitreader" # pdf reader
cask "kdiff3"
cask "ngrok"
cask "raycast" # spootlight alternative
cask "spotify"


### TAPS
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # tiling window manager
