brew "bat" # cat alternative
brew "bob" # neovim version manager
brew "chezmoi" # dotfiles manager
brew "curl" # http client
brew "eza" # ls replacement
brew "fish" # shell
brew "fzf" # fuzzy finder
brew "gcc" # nvim build dependency
brew "jq" # cli json utility
brew "lua-language-server" # LSP
brew "node" # nodejs
brew "rg" # rip grep
brew "starship" # shell prompt
brew "tree" # show tree like folder representation
brew "zellij" # terminal multiplexer
brew "zoxide" # better current dir changing
cask "alacritty" # terminal emulator
cask "anki" # study
cask "font-sf-pro" # sketchybar requirement
cask "nikitabobko/tap/aerospace" # tiling window manager
cask "raycast" # spootlight alternative
cask "sf-symbols" # sketchybar requirement
