### FORMULAES
brew "bat" # cat alternative
brew "cairo" # weasyprint requirement
brew "chezmoi" # dotfiles manager
brew "cmake" # nvim build dependency
brew "colima" # containers runtime
brew "curl" # http client
brew "curl" # nvim build dependency
brew "djlint" # html template lint and formatter
brew "docker" # container engine
brew "docker-compose" # docker tool
brew "eslint" # js ecosystem linter
brew "espeak" # requirement for english personal repo
brew "eza" # ls replacement
brew "fd" # faster find
brew "fish" # shell
brew "fzf" # fuzzy finder
brew "gcc" # nvim build dependency
brew "gdk-pixbuf" # weasyprint requirement
brew "gettext" # nvim build dependency
brew "jq" # cli json utility
brew "lazydocker" # docker management tool
brew "lazygit"
brew "libffi" # weasyprint requirement
brew "llvm" # c/c++ lsp
brew "lua-language-server" # LSP
brew "mypy" # python type checking
brew "ninja" # nvim build dependency
brew "node" # nodejs
brew "pango" # weasyprint requirement
brew "prettier" # js ecosystem formatter
brew "pyright" # LSP
brew "rg" # rip grep
brew "starship" # shell prompt
brew "stylua" # lua code formatter
brew "tree" # show tree like folder representation
brew "typescript-language-server" # LSP
brew "uv" # python package manager
brew "vscode-langservers-extracted"
brew "zellij" # terminal multiplexer
brew "zoxide" # better current dir changing

### CASKS
cask "anki" # study
cask "brave-browser"
cask "calibre"
cask "chatbox"
cask "corretto@21"
cask "digikam"
cask "drawio"
cask "foxitreader" # pdf reader
cask "ghostty" # terminal emulator
cask "mailspring"
cask "notion"
cask "postman"
cask "raycast" # spootlight alternative
cask "spotify"
cask "visual-studio-code"


### TAPS
tap "nikitabobko/tap"
cask "nikitabobko/tap/aerospace" # tiling window manager

### APP Store
### https://apps.apple.com/co/app/overlays/id868499627?l=en-GB&mt=12
